<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"ac2c0c18eb4c67ffb8982e0d2deec4a81edac659ad837aca8d84991aa4ffa2e3","plan_job_ref":"Job .github/workflows/_test-tf.yaml #114 at https://github.com/DND-IT/github-workflows/actions/runs/16826393004","plan_out_hash":"dbd54ddddfadd74194e65f23c180dd304130895a7ff03ccff8d7baea211f9a6b","plan_hash":"13385a61b5c417458b0576db36b4853a9455ba3016ac67eccf0c23c2ded1290b","plan_text_format":"diff","version":"2.2.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #114](https://github.com/DND-IT/github-workflows/actions/runs/16826393004)